In [3]:
import pandas as pd

#Creating a Series from a List
series = pd.Series([10,20,30,40,50])
print (series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [21]:
data = { "Name" : [ ' Alice ' , ' Bob ' , ' Charlie ' ] ,'Age' :[25, 30, 35],' City' :[ 'New York', 'Chicago',' Los Angeles']}


df = pd.DataFrame(data)
print(df)

        Name  Age          City
0     Alice    25      New York
1       Bob    30       Chicago
2   Charlie    35   Los Angeles

In [22]:
df.head()

        Name  Age          City
0     Alice    25      New York
1       Bob    30       Chicago
2   Charlie    35   Los Angeles

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2    City   3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [24]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [25]:
filtered_df =df[df['Age'] > 30]
print(filtered_df)

        Name  Age          City
2   Charlie    35   Los Angeles

In [26]:
print(df.columns)

Index(['Name', 'Age', ' City'], dtype='object')

In [34]:
selected_data =df.loc[0:1 , ['Name', 'City']]
print(selected_data)

      Name      City
0   Alice   New York
1     Bob    Chicago

In [35]:

df.iloc[0:2, [0,2]]

      Name      City
0   Alice   New York
1     Bob    Chicago

In [37]:
df["Salary"] = [7000, 8000, 9000]
df

        Name  Age          City  Salary
0     Alice    25      New York    7000
1       Bob    30       Chicago    8000
2   Charlie    35   Los Angeles    9000

In [38]:
df["Age"] = df["Age"] +1

print(df)

        Name  Age          City  Salary
0     Alice    26      New York    7000
1       Bob    31       Chicago    8000
2   Charlie    36   Los Angeles    9000

In [40]:
df = df.drop('City' , axis =1)
print(df)

        Name  Age  Salary
0     Alice    26    7000
1       Bob    31    8000
2   Charlie    36    9000

In [41]:
df_with_nan = pd.DataFrame({'A' : [1,2,None] , 'B' : [4, None , 6]})
print( df_with_nan.isnull() )

       A      B
0  False  False
1  False   True
2   True  False

In [48]:
import pandas as pd

df_with_nan = pd.DataFrame({
    'A': [1, 2, None],
    'B': [None, None, 6]
})

print(df_with_nan)

     A    B
0  1.0  NaN
1  2.0  NaN
2  NaN  6.0

In [50]:
df_with_nan.isnull()

       A      B
0  False   True
1  False   True
2   True  False

In [53]:
df_with_nan.isna()

       A      B
0  False   True
1  False   True
2   True  False

In [54]:
df_with_nan.isna().sum()

A    1
B    2
dtype: int64

In [55]:
df_with_nan.isna().sum().sum()

np.int64(3)

In [56]:
filled_df = df_with_nan.fillna (0)
print(filled_df)

     A    B
0  1.0  0.0
1  2.0  0.0
2  0.0  6.0

In [59]:
df_with_nan['A'] = df_with_nan['A'].fillna(df_with_nan['A'].mean())
df_with_nan

     A    B
0  1.0  NaN
1  2.0  NaN
2  1.5  6.0

In [60]:
df_with_nan['B'] = df_with_nan['B'].fillna(df_with_nan['B'].mean())
df_with_nan

     A    B
0  1.0  6.0
1  2.0  6.0
2  1.5  6.0

In [61]:
cleaned_df = df_with_nan.dropna()
print(cleaned_df)

     A    B
0  1.0  6.0
1  2.0  6.0
2  1.5  6.0

In [62]:
def double_salary(x):
    return x * 2

df['Double Salary'] = df['Salary'].apply(double_salary)
print(df)

        Name  Age  Salary  Double Salary
0     Alice    26    7000          14000
1       Bob    31    8000          16000
2   Charlie    36    9000          18000

In [67]:
department_data = {'Department': ['HR','IT', 'HR', 'IT'], 'Salary': [50000, 60000, 45000, 80000]}
df = pd.DataFrame(department_data)
mean_salary = df.groupby('Department')['Salary'].mean()
print(mean_salary)

Department
HR    47500.0
IT    70000.0
Name: Salary, dtype: float64

In [70]:

df_grades= pd.read_csv( "employees (1).csv" )

df_grades.head()

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30

In [71]:
df_grades.head(3)

   ID         Name Department  Age  Salary Joining_Date
0   1     John Doe         HR   28   50000   2020-05-21
1   2   Jane Smith         IT   34   75000   2019-06-12
2   3  Bob Johnson    Finance   45   85000   2018-07-15

In [72]:
df_grades.shape

(10, 6)

In [73]:
df_grades.dtypes

ID               int64
Name            object
Department      object
Age              int64
Salary           int64
Joining_Date    object
dtype: object

In [74]:
df_grades.columns

Index(['ID', 'Name', 'Department', 'Age', 'Salary', 'Joining_Date'], dtype='object')

In [76]:
df_grades.index

RangeIndex(start=0, stop=10, step=1)

In [77]:
df_grades["Name"]

0         John Doe
1       Jane Smith
2      Bob Johnson
3      Alice White
4    Charlie Brown
5        Eva Green
6       Mike Davis
7     Linda Taylor
8     James Wilson
9      Sarah Adams
Name: Name, dtype: object

In [78]:
df_grades.Name

0         John Doe
1       Jane Smith
2      Bob Johnson
3      Alice White
4    Charlie Brown
5        Eva Green
6       Mike Davis
7     Linda Taylor
8     James Wilson
9      Sarah Adams
Name: Name, dtype: object

In [80]:
df_grades[["Name" , "Salary"]]

            Name  Salary
0       John Doe   50000
1     Jane Smith   75000
2    Bob Johnson   85000
3    Alice White   72000
4  Charlie Brown   68000
5      Eva Green   54000
6     Mike Davis   90000
7   Linda Taylor   64000
8   James Wilson   70000
9    Sarah Adams   55000

In [82]:
df_grades.Name[0]

'John Doe'

In [83]:
df_grades.Name[1:4]

1     Jane Smith
2    Bob Johnson
3    Alice White
Name: Name, dtype: object

In [87]:
first_name = df_grades.loc[0 , "Name"] 
first_name

'John Doe'

In [90]:
slic_one = df_grades.loc[0:2 , "Name" :"Age"] 
slic_one

          Name Department  Age
0     John Doe         HR   28
1   Jane Smith         IT   34
2  Bob Johnson    Finance   45

In [92]:
df_grades.Salary.mean()

np.float64(68300.0)

In [94]:
df_grades["Salary"].max()

np.int64(90000)

In [95]:
df_grad = df_grades.describe()
df_grad[["Age" , "Salary"]]

             Age        Salary
count  10.000000     10.000000
mean   35.300000  68300.000000
std     7.958922  13106.826042
min    26.000000  50000.000000
25%    29.250000  57250.000000
50%    33.000000  69000.000000
75%    40.250000  74250.000000
max    50.000000  90000.000000

In [98]:
df_grades

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
5   6      Eva Green         HR   41   54000   2017-04-22
6   7     Mike Davis    Finance   50   90000   2016-08-19
7   8   Linda Taylor         IT   26   64000   2022-02-10
8   9   James Wilson  Marketing   38   70000   2020-09-08
9  10    Sarah Adams         HR   30   55000   2021-03-18

In [101]:
mm = df_grades["Department"].value_counts()
mm

Department
HR           3
IT           3
Finance      2
Marketing    2
Name: count, dtype: int64

In [103]:
mm["IT"]

np.int64(3)

In [109]:
 un_value = df_grades["Department"].unique()
un_value

array(['HR', 'IT', 'Finance', 'Marketing'], dtype=object)

In [106]:
len(un_value)

4

In [112]:
 df_grades["Department"].nunique()

4

In [107]:
un_value[0]

'HR'

In [113]:
df_grades.shape

(10, 6)

In [115]:
df_grades.dtypes

ID               int64
Name            object
Department      object
Age              int64
Salary           int64
Joining_Date    object
dtype: object

In [119]:
df_grades["Salary"].mean()

np.float64(68300.0)

In [120]:
df_grades["new"] = 1

In [121]:
df_grades

   ID           Name Department  Age  Salary Joining_Date  new
0   1       John Doe         HR   28   50000   2020-05-21    1
1   2     Jane Smith         IT   34   75000   2019-06-12    1
2   3    Bob Johnson    Finance   45   85000   2018-07-15    1
3   4    Alice White         IT   29   72000   2021-01-04    1
4   5  Charlie Brown  Marketing   32   68000   2019-11-30    1
5   6      Eva Green         HR   41   54000   2017-04-22    1
6   7     Mike Davis    Finance   50   90000   2016-08-19    1
7   8   Linda Taylor         IT   26   64000   2022-02-10    1
8   9   James Wilson  Marketing   38   70000   2020-09-08    1
9  10    Sarah Adams         HR   30   55000   2021-03-18    1

In [128]:
df_grades["Final_percentage"] = df_grades["Salary"] / 36
df_grades.head()

,ID,Name,Department,Age,Salary,Joining_Date,new,Final_percentage
0,1,John Doe,HR,28,50000,2020-05-21,1,1388.888889
1,2,Jane Smith,IT,34,75000,2019-06-12,1,2083.333333
2,3,Bob Johnson,Finance,45,85000,2018-07-15,1,2361.111111
3,4,Alice White,IT,29,72000,2021-01-04,1,2000.000000
4,5,Charlie Brown,Marketing,32,68000,2019-11-30,1,1888.888889

In [131]:
del df_grades["Final_percentage"]
df_grades.head()

   ID           Name Department  Age  Salary Joining_Date  new
0   1       John Doe         HR   28   50000   2020-05-21    1
1   2     Jane Smith         IT   34   75000   2019-06-12    1
2   3    Bob Johnson    Finance   45   85000   2018-07-15    1
3   4    Alice White         IT   29   72000   2021-01-04    1
4   5  Charlie Brown  Marketing   32   68000   2019-11-30    1